import Product from "../component/interface/product";


const DefaultProducts : Array<Product> = [
    {
        id: 0,
        name: 'Брюки',
        description: 'Брюки мужские',
        count: 1,
        unit: 'штук',
        category : 'Брюки'
      },
      {
        id: 1,
        name: 'Кроссовки Кроссовки Кроссовки Кроссовки Кроссовки Кроссовки',
        count: 1,
        unit: 'штук',
        description : "Хотите быть стильным и комфортным в любое время года, Представляем вам кроссовки мужские , которые подойдут как для весныи лето , так и для демисезонного периода. Эти обувь мужская летняя отлично смотрятся и подходят для активного образа жизни. Наша компания предлагает вам широкий выбор кроссовок которые идеально подходят для мужчин. В нашем ассортименте есть как осенние, так и летние модели. Кроссовки мужские – это не только стильный аксессуар, но и надежная защита для ваших ног. Они выполнены из высококачественных материалов, которые обеспечивают долговечность и комфорт. Наши кроссовки идеально подойдут для занятий спортом, прогулок и повседневной носки. Они обеспечивают отличную амортизацию и поддержку стопы, что позволяет вам чувствовать себя комфортно в любых условиях. Весенние и демисезонные кроссовки мужские – это отличный выбор для тех, кто ценит комфорт и стиль. Они легкие и удобные, что позволяет ноге свободно дышать. Благодаря своему дизайну, они станут незаменимым элементом вашего гардероба. Осенние кроссовки мужские предлагают надежную защиту от влаги и холода. Они имеют прочную подошву, которая обеспечивает отличное сцепление с поверхностью. Вы сможете чувствовать себя уверенно и безопасно даже в дождливую погоду. Летние кроссовки для малчика – это отличный выбор для тех, кто любит активный отдых. Они обладают отличной вентиляцией, что позволяет ноге оставаться сухой и прохладной даже в жаркие дни. Выбирая кроссовки мужские, вы получаете не только стильный аксессуар, но и надежную защиту для ваших ног. Наша компания гарантирует высокое качество и комфорт при носке. Не упустите возможность выглядеть стильно и быть комфортным в любое время года. Закажите кроссовки мужские прямо сейчас и наслаждайтесь активным образом жизни!",
        category : 'Обувь'
      },
      {
        id: 2,
        name: 'Куртка мужская зимняя',
        count: 1,
        unit: 'штук',
        category: 'Верхняя одежда'
      },
      {
        id: 3,
        name: 'Куртка мужская зимняя',
        count: 1,
        unit: 'штук',
        category: 'Верхняя одежда'
      },
      {
        id: 4,
        name: 'Парка женская зимняя с натуральным мехом',
        count: 0,
        unit: 'штук',
        category: 'Верхняя одежда',
        description : 'Парка женская зимняя с натуральным мехом. Создайте себе яркий зимний образ'
      }
]

export default DefaultProducts